export const PrivacyPolicyText = () => {
  return (
    <div className="wrapper md:w-[80ch] w-full flex flex-col gap-4 text-justify">
      <h1 className="text-3xl text-center font-bold">
        ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
      </h1>
      <div>
        <p className="indent-[2em]">
          Настоящая Политика конфиденциальности персональных данных
          распространяется на сайт saddlyavas.by и все его поддомены (далее –
          Сайт) и действует по отношению ко всей информации, которую может
          получить Пользователь во время использования Сайта.
        </p>
        <p className="indent-[2em]">
          Во время пользования Сайтом, а также при регистрации на Сайте,
          Пользователь подтверждает своё согласие на обработку и использование
          данных на тех условиях, которые изложены в настоящей Политике
          конфиденциальности.
        </p>
        <p className="indent-[2em]">
          Отношения, связанные со сбором, хранением, распространением и защитой
          информации, предоставляемой Пользователем, регулируются настоящей
          Политикой конфиденциальности и действующим законодательством
          Республики Беларусь.
        </p>
        <p className="indent-[2em]">
          В случае несогласия Пользователя с условиями настоящей Политики
          использование сайта должно быть немедленно прекращено.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
        <p className="indent-[2em]">
          1.1. Сайт – веб-сайт ии программное обеспечение, расположенные в сети
          Интернет по адресу https://saddlyavas.by.
        </p>
        <p className="indent-[2em]">
          Все исключительные права на сайт и его отдельные элементы (включая
          программное обеспечение, дизайн) принадлежат в полном объеме владельцу
          сайта – КФХ «Сад для Вас» (зарегистрировано в Республике Беларусь и
          расположено по адресу: Минская обл., Минский р-н., 22-ой км трассы Р
          23 Минск – Микашевичи).
        </p>
        <p className="indent-[2em]">
          1.2. Администрация сайта – официальные представители владельца сайта,
          имеющие права на управление сайтом и (или) обработку персональных
          данных.
        </p>
        <p className="indent-[2em]">
          1.3. Пользователь – физическое или юридическое лицо, имеющее доступ к
          сайту через сеть Интернет и использующее информацию, представленную на
          сайте, в личных либо служебных целях.
        </p>
        <p className="indent-[2em]">
          1.4. Персональные данные – персональные данные Пользователя, которые
          Пользователь предоставляет о себе самостоятельно или в процессе
          использования функционала сайта.
        </p>
        <p className="indent-[2em]">
          1.5. Обработка персональных данных – любые действия, совершаемые с
          персональными данными, включая сбор, запись, систематизацию,
          накопление, хранение, обновление, использование, передачу, удаление
          персональных данных.
        </p>
        <p className="indent-[2em]">
          1.6. Конфиденциальность персональных данных – обязательное требование
          не допускать их распространения, за исключением случаев, установленных
          законодательством.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">
          2. СБОР И ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ. ПРАВА ПОЛЬЗОВАТЕЛЕЙ
        </h2>
        <p className="indent-[2em]">
          2.1. КФХ «Сад для Вас» собирает и хранит только те персональные
          данные, которые необходимы для идентификации Пользователя, оказания
          услуг и взаимодействия с Пользователем.
        </p>
        <p className="indent-[2em]">
          В случаях, когда Пользователь заполняет заявку на оказание услуг,
          регистрирует учетную запись на сайте, подписывается на рассылки КФХ
          «Сад для Вас», участвует в любых соответствующих акциях, розыгрышах,
          совершает любые иные действия на сайте и/или использует любую часть
          сайта, он дает согласие:
        </p>
        <ul>
          <li className="indent-[2em]">
            • на обработку своих персональных данных, включая сбор,
            систематизацию, накопление, хранение, обработку, уточнение
            (обновление, изменение), сопоставление, использование,
            обезличивание, блокирование, уничтожение, а также осуществление
            любых иных действий с персональными данными с учетом действующего
            законодательства;
          </li>
          <li className="indent-[2em]">
            • на получение рекламных материалов, новостной рассылки и (или) иной
            информации от КФХ «Сад для Вас» посредством электронной,
            факсимильной связи, SMS, Viber, Telegram и иных средств связи;
          </li>
          <li className="indent-[2em]">
            • проведение статистических и иных исследований.
          </li>
        </ul>
        <p className="indent-[2em]">
          Также Пользователь дает всоё согласие на использование персональных
          данных в целях:
        </p>
        <ul>
          <li className="indent-[2em]">
            • идентификации Пользователя, зарегистрированного на сайте;
          </li>
          <li className="indent-[2em]">
            • предоставления и предложения товаров, работ (услуг);
          </li>
          <li className="indent-[2em]">
            • улучшения качества предоставления услуг и качества сайта, удобства
            его использования, разработки новых функций и возможностей;
          </li>
          <li className="indent-[2em]">• предоставления сервисов сайта;</li>
          <li className="indent-[2em]">
            • установления с Пользователем обратной связи, включая направление
            уведомлений, касающихся использования сайта, оказания услуг,
            обработка сообщений от Пользователя.
          </li>
          <li className="indent-[2em]">
            • подтверждения достоверности и полноты персональных данных,
            предоставленных Пользователем;
          </li>
          <li className="indent-[2em]">
            • создания учетной записи Пользователя.
          </li>
        </ul>
        <p className="indent-[2em]">
          Личные сведения, собранные КФХ «Сад для Вас» посредством сайта, могут
          быть объединены с информацией, которую Пользователь сообщает другими
          способами (устно, письменно, посредством факсимильной связи и т.п.).
        </p>
        <p className="indent-[2em]">
          Согласие Пользователя действует до момента его отзыва Пользователем
          путем направления соответствующего письменного уведомления КФХ «Сад
          для Вас» по адресу электронной почты: sad_dlya_vas@hotmail.com.
        </p>
        <p className="indent-[2em]">
          2.2. КФХ «Сад для Вас» собирает и обрабатывает следующие персональные
          данные:
        </p>
        <ul>
          <li className="indent-[2em]">• имя и фамилия Пользователя;</li>
          <li className="indent-[2em]">
            • контактный номер телефона Пользователя;
          </li>
          <li className="indent-[2em]">• адрес электронной почты (e-mail);</li>
          <li className="indent-[2em]">• адрес доставки товаров.</li>
        </ul>
        <p className="indent-[2em]">2.3. Пользователь имеет право:</p>
        <p className="indent-[2em]">
          2.3.1. узнать (запросить) какие его персональные данные хранятся у КФХ
          «Сад для Вас»;
        </p>
        <p className="indent-[2em]">
          2.3.2. требовать уточнения своих персональных данных, их блокирования
          или уничтожения в случае, если персональные данные являются неполными,
          устаревшими, недостоверными;
        </p>
        <p className="indent-[2em]">
          2.3.3. отозвать свое согласие на сбор и обработку персональных данных.
        </p>
        <p className="indent-[2em]">
          2.3.4. получать информацию о сроках обработки своих персональных
          данных, в том числе о сроках их хранения;
        </p>
        <p className="indent-[2em]">
          2.3.5. обжаловать в уполномоченном органе по защите прав субъектов
          персональных данных или в судебном порядке неправомерные действия или
          бездействия при обработке его персональных данных;
        </p>
        <p className="indent-[2em]">
          2.4. на уничтожение персональных данных в случае отзыва своего
          согласия в порядке, предусмотренном п.3.6. Политики
          конфиденциальности.
        </p>
        <p className="indent-[2em]">
          2.5. КФХ «Сад для Вас» не несет ответственности за недостоверную
          информацию, предоставленную Пользователем.
        </p>
        <p className="indent-[2em]">
          2.6. Пользователь соглашается с тем, что если он разрешил
          предоставление его персональной информации третьим лицам, то КФХ «Сад
          для Вас» не может контролировать использование третьими лицами
          раскрытых персональных данных Пользователя.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">
          3. ПОРЯДОК ОБРАБОТКИ ПЕРСОНАЛЬНЫХ И ИНЫХ ДАННЫХ. ЗАЩИТА ПЕРСОНАЛЬНЫХ
          ДАННЫХ
        </h2>
        <p className="indent-[2em]">
          3.1. КФХ «Сад для Вас» обязуется использовать персональные данные в
          соответствии с действующим законодательством Республики Беларусь.
        </p>
        <p className="indent-[2em]">
          3.2. В отношении персональных данных и иных данных Пользователя
          сохраняется их конфиденциальность, кроме случаев:
        </p>
        <ul>
          <li className="indent-[2em]">
            • когда указанные данные являются общедоступными;
          </li>
          <li className="indent-[2em]">
            • добровольного предоставления Пользователем информации о себе для
            общего доступа неограниченному кругу лиц;
          </li>
          <li className="indent-[2em]">
            • использования данных с согласия Пользователя;
          </li>
          <li className="indent-[2em]">
            • необходимости использования Пользователем определенного сервиса
            сайта либо для оказания услуги Пользователю;
          </li>
          <li className="indent-[2em]">
            • необходимости предоставления такой информации в соответствии с
            законодательством Республики Беларусь или иным применимым
            законодательством и (или) на основании требования уполномоченного
            государственного органа.
          </li>
        </ul>
      </div>
      <div>
        <h2 className="text-xl font-bold">4. ССЫЛКИ НА ДРУГИЕ САЙТЫ</h2>
        <p className="indent-[2em]">
          4.1. На сайте есть и будут в дальнейшем появляться ссылки на внешние
          сайты. КФХ «Сад для Вас» не контролирует их содержимое и не отвечает
          за них. Эти сайты должны иметь собственные политики
          конфиденциальности.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">
          5. ОБНОВЛЕНИЕ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
        </h2>
        <p className="indent-[2em]">
          5.4. КФХ «Сад для Вас» имеет право в любой момент изменять Политику
          конфиденциальности (полностью или в части) в одностороннем порядке без
          предварительного согласования с Пользователем.
        </p>
        <p className="indent-[2em]">
          5.5. Новая редакция Политики вступает в силу с момента ее размещения,
          если иное не предусмотрено новой редакцией Политики. Действующая
          редакция всегда находится на странице по адресу
          https://saddlyavas.by/privacy.
        </p>
        <p className="indent-[2em]">
          5.6. Пользователь обязуется регулярно самостоятельно следить за
          изменениями Политики конфиденциальности путем ознакомления с
          актуальной редакцией.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
        <p className="indent-[2em]">
          6.1. К настоящей Политике и отношениям между Пользователем и КФХ «Сад
          для Вас», возникающим в связи с применением Политики
          конфиденциальности, подлежит применению право Республики Беларусь.
        </p>
        <p className="indent-[2em]">
          6.2. Переписка между КФХ «Сад для Вас» и Пользователем осуществляется
          по электронной почте. КФХ «Сад для Вас» направляет письма Пользователю
          по адресу, указанному Пользователем при регистрации. Отправленное КФХ
          «Сад для Вас» письмо по электронной почте считается полученным
          Пользователем в тот же день.
        </p>
      </div>
    </div>
  );
};
