export const OfferAgreementText = () => {
  return (
    <div className="wrapper md:w-[80ch] w-full flex flex-col gap-4 text-justify">
      <div>
        <h1 className="text-3xl text-center font-bold">
          ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ
        </h1>
        <p className="text-center">
          на приобретение товаров через Онлайн-магазин saddlyavas.by
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
        <p className="indent-[2em]">
          1.1. Настоящий договор определяет порядок ведения Продавцом
          купли-продажи Товара через Онлайн-магазин в соответствии со ст. 405
          Гражданского кодекса Республики Беларусь (далее – ГК РБ) и является
          официальной публичной офертой Продавца, адресуемой неопределенному
          кругу лиц.
        </p>
        <p className="indent-[2em]">
          1.2. Фактом принятия (акцепта) Покупателем условий настоящего Договора
          является:
        </p>
        <ul>
          <li className="indent-[2em]">
            • сообщение о выборе и заказе товара, отправленное путем нажатия
            кнопки «Оформить заказ» в разделе «Корзина» посредством электронной
            связи, в порядке и на условиях, определенных настоящим Договором и
            условиями (п.3 ст.408 Гражданского Кодекса Республики Беларусь).
          </li>
          <li className="indent-[2em]">
            • передача Покупателю сообщения о намерении приобрести товар
            посредством почтовой, телеграфной, телетайпной, телефонной,
            электронной или иной связи, позволяющей достоверно установить, что
            сообщение исходит от Покупателя, а также в иной форме, не
            запрещенной законодательством РБ.
          </li>
        </ul>
        <p className="indent-[2em]">
          1.3 Договор может быть заключен путем составления документа,
          подписанного сторонами.
        </p>
        <p className="indent-[2em]">
          1.4 Договор купли-продажи товара по образцу считается заключенным с
          момента составления документа, подписанного сторонами.
        </p>
        <p className="indent-[2em]">
          1.5 Договор розничной купли-продажи товара по образцу считается
          заключенным с момента выдачи Продавцом Покупателю кассового или
          товарного чека, иного документа, подтверждающего факт приобретения
          товара, если иное не предусмотрено законодательством или договором.
        </p>
        <p className="indent-[2em]">
          1.6 Договор считается исполненным с момента доставки товара в место,
          указанное в договоре, а если место передачи товара договором не
          определено, – с момента доставки товара по месту жительства Покупателя
          или иному указанному им адресу.
        </p>
        <p className="indent-[2em]">
          1.3. При совместном упоминании Покупателя и Продавца по тексту
          настоящего договора последние именуются Стороны, а каждый по
          отдельности Сторона.
        </p>
        <p className="indent-[2em]">
          1.4. Каждая Сторона гарантирует другой Стороне, что обладает
          соответствующим правом и достаточным объемом дееспособности, а равно
          всеми иными правами и полномочиями, необходимыми для заключения и
          исполнения настоящего договора.
        </p>
        <p className="indent-[2em]">
          1.5. Осуществляя Заказ Товара через Онлайн-магазин, Покупатель
          принимает и соглашается со всеми условиями, изложенными в настоящем
          договоре, и с информацией, размещенной на Сайте в момент принятия
          Продавцом Заказа.
        </p>
        <p className="indent-[2em]">
          1.6. К отношениям между Сторонами по настоящему договору применяются
          требования Законов Республики Беларусь «О торговле», «О защите прав
          потребителей» (далее – Закон) и иные нормативные и правовые акты
          Республики Беларусь, регулирующие вопросы розничной купли- продажи.
        </p>
        <p className="indent-[2em]">
          1.7. Продавец оставляет за собой право вносить изменения в настоящий
          договор и в информацию на Сайте, в связи с чем Покупатель обязуется на
          момент обращения к Продавцу с Заказом на Товар учитывать возможные
          изменения.
        </p>
        <p className="indent-[2em]">
          1.8. Публикация информации, очевидно не соответствующей товару, в том
          числе цены, фото и описания товара, признается технической ошибкой.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">
          2. ОФОРМЛЕНИЕ И СРОКИ ВЫПОЛНЕНИЯ ЗАКАЗА
        </h2>
        <p className="indent-[2em]">
          2.1. Заказ Покупателя может быть оформлен по телефону и/или через
          Сайт.
        </p>
        <p className="indent-[2em]">
          2.1.1. При оформлении Заказа по телефону Покупатель предоставляет
          Продавцу следующую необходимую информацию для оформления Заказа:
          желаемый товар и количество, адрес доставки товара, контактный
          телефон, желаемое время получения заказа, фамилия, имя Получателя.
        </p>
        <p className="indent-[2em]">
          2.1.2. При оформлении Заказа через Сайт Покупатель заполняет
          электронную форму Заказа на Товар и отправляет сформированный Заказ
          Продавцу посредством сети Интернет.
        </p>
        <p className="indent-[2em]">
          2.2. Информация в Заказе, полученном Продавцом, согласовывается с
          Покупателем либо Получателем по контактному телефону или электронной
          почте с целью уточнения, в том числе, конкретной даты и времени
          доставки Товара.
        </p>
        <p className="indent-[2em]">
          2.3. Неправильно или неточно указанная информация препятствует
          исполнению заказа в указанный срок. В подобных случаях, время
          выполнения доставки переносится нами на тот период, пока не будет
          получена недостающая корректная информация.
        </p>
        <p className="indent-[2em]">
          2.4. При оформлении Заказа через Сайт Покупатель получает на указанный
          им электронный адрес уведомительное электронное Письмо, подтверждающее
          факт оформления покупателем формы Заказа на сайте Продавца. Данное
          уведомительное письмо не является подтверждением факта принятия Заказа
          Продавцом.
        </p>
        <p className="indent-[2em]">
          2.5. В случае обнаружения, что на складе Продавца отсутствует
          необходимый Товар или необходимое его количество, Продавец информирует
          об этом Покупателя по контактному телефону, отраженному в Заказе.
          Покупатель вправе согласиться принять Товар в количестве, имеющемся в
          наличии у Продавца, либо отказаться (аннулировать) от Заказа.
        </p>
        <p className="indent-[2em]">
          2.5. В случае возникновения у Покупателя вопросов, касающихся
          описания, свойств и характеристик Товара, перед оформлением Заказа
          Покупатель должен обратиться к Продавцу по телефонам или с помощью
          средств онлайн-консультации, указанным на Сайте Онлайн-магазина.
        </p>
        <p className="indent-[2em]">
          2.6. Заказ сформировать вы можете на сайте в режиме онлайн 24 часа в
          сутки. Кроме этого, Вы можете оформить заказ, связавшись с нами по
          телефону. Прием и обработка заказов с сайта и по телефону
          осуществляется с 08:30 утра до 18:00
        </p>
        <p className="indent-[2em]">
          2.6.1. Заказы, поступившие на сайт в рабочее время с 08:30 утра до
          18:00 обрабатываются нами в течение 1 часа с момента поступления, и
          принимаются к исполнению после окончательного согласования нашим
          оператором с Вами всех условий доставки по телефону.
        </p>
        <p className="indent-[2em]">
          2.6.2. Заказы, поступившие на сайт в нерабочее время принимаются к
          исполнению на следующий рабочий день с 8:30 после окончательного
          согласования нашим оператором с Вами всех условий доставки по телефону
          в течение 1 часа.
        </p>
        <p className="indent-[2em]">
          2.6.3. Временной интервал осуществления доставки при оплате наличными
          составляет от 1 до 4 часов с момента окончательного согласования
          Заказа. Выполнение доставки заказа при безналичной форме расчетов,
          осуществляется в течение 4 часов после подтверждения его 100% оплаты.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">3.ДОСТАВКА ТОВАРА</h2>
        <p className="indent-[2em]">
          3.1. При Заказе Товара Покупателем на условиях доставки Продавец
          приложит все усилия, чтобы соблюсти сроки доставки Товара, указанные
          на Сайте или согласованные с Покупателем после оформления заказа, при
          этом не исключая причин, которые могут возникнуть и повлиять на сроки
          доставки в виде непредвиденных событий и обстоятельств, произошедших
          не по вине Продавца.
        </p>
        <p className="indent-[2em]">
          3.2 Доставка заказа осуществляется нами после предварительного
          согласования с Получателем возможности и удобства получения товара,
          поэтому его телефон в бланке заказа указывать обязательно.
        </p>
        <p className="indent-[2em]">
          3.3. Покупатель может запросить доставку товара без предварительного
          звонка Получателю, при этом Заказ доставляется по указанному
          заказчиком в заявке адресу. Если в момент доставки Получателя нет на
          месте, мы передаем заказ третьим лицам (родственникам, коллегам,
          соседям, консьержу, охране и др.). Если случается так, что принять
          заказ никто не может, доставка заказа считается выполненной, или, если
          оказалось, что адрес указан некорректно, то доставка также считается
          выполненной полностью, и сумма оплаты за заказ возврату не подлежит.
        </p>
        <p className="indent-[2em]">
          3.4. Риск случайной гибели или случайного повреждения Товара переходит
          к Покупателю или Получателю в момент передачи Товара или проставления
          Покупателем или Получателем Товара личной подписи в документах,
          подтверждающих доставку Товара.
        </p>
        <p className="indent-[2em]">
          3.5. В момент доставки Товара лицо, осуществляющее доставку,
          демонстрирует Покупателю и/или Получателю внешний вид. Если товар
          имеет внешние недостатки, покупатель имеет право отказаться от товара.
        </p>
        <p className="indent-[2em]">
          3.6. Покупатель или Получатель в момент получения Товара получает
          пакет документов на Товар: – кассовый чек, при условии, что оплата
          производится в момент получения заказа;
        </p>
        <p className="indent-[2em]">
          3.7. Проверка Товара должна производиться с сохранением товарного
          вида.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">4. ОПЛАТА ТОВАРА </h2>
        <p className="indent-[2em]">
          4.1. Цена Товара указывается рядом с определенным наименованием товара
          на Сайте Онлайн- магазина на странице товара в белорусских рублях.
        </p>
        <p className="indent-[2em]">
          4.2. Цена Товара на Сайте Онлайн-магазина может быть изменена
          Продавцом в одностороннем порядке.
        </p>
        <p className="indent-[2em]">
          4.3. Оплата Товара Покупателем или Получателем производится в
          белорусских рублях в форме и способами, указанными Продавцом в разделе
          «оплата» на Сайте Онлайн-магазина.
        </p>
        <p className="indent-[2em]">
          4.4. Продавец вправе предоставлять Покупателю или Получателю скидки на
          Товары и устанавливать программу бонусов. Виды скидок, порядок и
          условия начисления и предоставления бонусов указываются на Сайте
          Онлайн-магазина в публичном доступе и могут быть изменены Продавцом в
          одностороннем порядке.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">5. ВОЗВРАТ ТОВАРА</h2>
        <p className="indent-[2em]">
          5.1. Покупатель или Получатель вправе отказаться от получения Товара в
          любое время до его оплаты, согласно Закону, возврат Товара бывшего в
          употреблении невозможен.
        </p>
        <p className="indent-[2em]">
          5.2. Покупатель или Получатель не имеет права возвратить Товар
          надлежащего качества, согласно Перечню непродовольственных товаров
          надлежащего качества, не подлежащих обмену и возврату, утвержденному
          Постановлением Совета Министров Республики Беларусь № 778 от
          14.06.2002 года.
        </p>
        <p className="indent-[2em]">
          5.4. В случае отказа Покупателя или Получателя от договора, согласно
          условиям пункта 5.1 настоящего договора, и одновременного предъявления
          требования о возврате уплаченной за Товар денежной суммы, стоимость
          Товара подлежит возврату Покупателю или Получателю в течение 14
          рабочих дней, исключая субботу и воскресенье, с момента получения
          Продавцом письменного заявления Покупателя или Получателя.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">6. ГАРАНТИИ И ОТВЕТСТВЕННОСТЬ </h2>
        <p className="indent-[2em]">
          6.1. Продавец не несет ответственности за ущерб, причиненный
          Покупателю или Получателю вследствие ненадлежащего использования
          последними Товара, приобретенного в Онлайн- магазине Продавца.
        </p>
        <p className="indent-[2em]">
          6.2. Продавец не несет ответственности за содержание и
          функционирование других сайтов Интернета.
        </p>
        <p className="indent-[2em]">
          6.3. Продавец не несет ответственности за последствия, связанные с
          действиями Покупателя или Получателя в случае использования Товара,
          приобретенного у Продавца, в предпринимательских целях.
        </p>
        <p className="indent-[2em]">
          6.4. Продавец не отвечает за убытки Покупателя или Получателя,
          возникшие в результате: – предоставления не достоверной информации при
          согласовании Заказа, в т.ч. неправильного указания идентификационных
          сведений; – неправомерных действий третьих лиц.
        </p>
        <p className="indent-[2em]">
          6.5. Покупатель или Получатель несет полную ответственность за
          достоверность идентификационных сведений, указанных им при Заказе
          Товара в Онлайн-магазине
        </p>
        <p className="indent-[2em]">
          6.6. Стороны освобождаются от ответственности за полное или частичное
          неисполнение своих обязательств, если такое неисполнение явилось
          следствием действия обстоятельств непреодолимой силы, возникших после
          вступления в силу настоящего договора и/или в результате событий
          чрезвычайного характера, которые Стороны не могли предвидеть и
          предотвратить разумными мерами.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">
          7. КОНФИДЕНЦИАЛЬНОСТЬ И ЗАЩИТА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
        </h2>
        <p className="indent-[2em]">
          7.1. Предоставление информации Покупателем.
        </p>
        <p className="indent-[2em]">
          7.1.1. При формировании Заказа на Товар через Сайт Интернет-магазина
          или по телефону, Покупатель предоставляет Продавцу информацию,
          позволяющую Продавцу идентифицировать Покупателя и добросовестно и в
          срок исполнить условия настоящего договора.
        </p>
        <p className="indent-[2em]">
          7.1.2. Предоставляя свои персональные данные при заказе Товара,
          Покупатель соглашается на их обработку Продавцом, в том числе и в
          целях продвижения Продавцом товаров и услуг.
        </p>
        <p className="indent-[2em]">
          7.1.3. Если Покупатель не желает, чтобы его персональные данные
          обрабатывались, то он должен обратиться к Продавцу через форму
          «Обратной связи» на Сайте. В таком случае вся полученная от Покупателя
          персональная информация удаляется из клиентской базы Продавца.
        </p>
        <p className="indent-[2em]">
          7.2. Использование информации, предоставленной Покупателем и
          полученной Продавцом.
        </p>
        <p className="indent-[2em]">
          7.2.1. Продавец использует информацию: – для выполнения своих
          обязательств перед Покупателем;
        </p>
        <p className="indent-[2em]">
          7.3. Разглашение информации, полученной Продавцом:
        </p>
        <p className="indent-[2em]">
          7.3.1. Продавец обязуется не разглашать полученную от Покупателя
          информацию. Не считается нарушением предоставление Продавцом
          информации агентам и третьим лицам, действующим на основании договора
          с Продавцом, для исполнения обязательств перед Покупателем или
          Получателем.
        </p>
        <p className="indent-[2em]">
          7.3.2. Не считается нарушением обязательств разглашение информации в
          соответствии с обоснованными и применимыми требованиями
          законодательства.
        </p>
      </div>
      <div>
        <h2 className="text-xl font-bold">8. ПРОЧИЕ УСЛОВИЯ</h2>
        <p className="indent-[2em]">
          8.1. К отношениям между Покупателем и Продавцом применяется право
          Республики Беларусь.
        </p>
        <p className="indent-[2em]">
          8.2. В случае возникновения вопросов и претензий со стороны Покупателя
          или Получателя, он должен обратиться к Продавцу по телефону на Сайте
          Онлайн- магазина.
        </p>
        <p className="indent-[2em]">
          8.3. Все возникающее споры Стороны будут стараться решить путем
          переговоров. При не достижении обоюдовыгодного соглашения, спор между
          Сторонами будет передан на рассмотрение в судебный орган в
          соответствии с действующим законодательством Республики Беларусь.
        </p>
        <p className="indent-[2em]">
          8.4. Признание судом недействительности какого-либо положения
          настоящего договора не влечет за собой недействительность его
          остальных положений.
        </p>
        <p className="indent-[2em]">
          8.5. Продавец имеет право использовать электронный адрес и телефонные
          номера Покупателя для рассылки информационных сообщений.
        </p>
      </div>
      <div>
        <p className="indent-[2em]">
          КФХ «Сад для Вас», Бердникович Анатолий Иванович, УНП: 691532502, Дата
          регистрации: 29.12.2012
        </p>
        <p className="indent-[2em]">
          Адрес: Республика Беларусь, Минская обл., Минский р-н., 22-ой км
          трассы Р 23 Минск – Микашевичи
        </p>
      </div>
    </div>
  );
};
